{
  "backend/main.mo": "Empty Motoko actor with no logic implemented.",
  "feature_evidence.json": "Feature evidence report mapping implemented features to source files and components with metadata.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each major frontend component and content file.",
  "frontend/index.css": "Global Tailwind-based styles defining OKLCH color variables, dark mode overrides, and base layout styling.",
  "frontend/index.html": "HTML entry point loading the React app via main.tsx into the root div.",
  "frontend/src/App.tsx": "Main React component rendering navigation, hero section, multiple educational sections, references, and footer.",
  "frontend/src/components/CalloutCard.tsx": "Reusable styled card component with variant-based icons and border colors for highlighting information.",
  "frontend/src/components/DisclaimerBanner.tsx": "Alert banner component showing a highlighted medical disclaimer with list of cautions.",
  "frontend/src/components/SectionShell.tsx": "Layout wrapper providing consistent spacing, headings, and scroll offset for each content section.",
  "frontend/src/components/SiteFooter.tsx": "Footer displaying site description, author credits, quick links, and attribution.",
  "frontend/src/components/TopNav.tsx": "Responsive sticky navigation bar with smooth scroll, mobile sheet menu, and scroll-state styling.",
  "frontend/src/content/blueLightCircadianContent.ts": "Defines structured content about blue light, circadian rhythms, biological mechanisms, and research findings for use in the UI.",
  "frontend/src/content/references.ts": "Exports a Reference interface and a list of citation objects for the references section.",
  "frontend/src/hooks/useActor.ts": "Provides a React hook that creates and manages a backend actor based on the current Internet Identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity context and provider logic, handling login, identity loading, and status management using Dfinity’s AuthClient.",
  "frontend/src/index.css": "Defines global Tailwind base styles, custom CSS variables, color themes, typography rules, and dark mode variants.",
  "frontend/src/main.tsx": "Bootstraps the React app by creating the root, wrapping it with QueryClientProvider and InternetIdentityProvider, and loading global styles.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, typography, container settings, animations, and plugins for the project.",
  "project_state.json": "Describes the project’s metadata, features, requirements, and current state for build and planning purposes."
}